Revit 2027 API
AdvancedWood.WoodDiffusePerlinProf Property
 The property labeled "Profile for diffuse albedo perlin noise" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodDiffusePerlinProf { get; }
Public Shared ReadOnly Property WoodDiffusePerlinProf As String
	Get
public:
static property String^ WoodDiffusePerlinProf {
	String^ get ();
}
static member WoodDiffusePerlinProf : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace